# COMBINATION OF MULTIPLE DATAFRAMES
# 1. Concatination

Often the data you need exists in two separate sources, fortunately, pandas makes it easy to combine these together.

The simplest combination is if sources are already in same format, then a Concatination through the pd.concat() call is all that is needed.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one={'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4']}

In [3]:
data_two={'C':['C1','C2','C3','C4'],'D':['D1','D2','D3','D4']}

In [4]:
one=pd.DataFrame(data_one)

In [5]:
two=pd.DataFrame(data_two)

In [6]:
one

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [7]:
two

    C   D
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

In [8]:
# Combine the column
pd.concat([one,two],axis=1)

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [9]:
pd.concat([two,one],axis=1)

    C   D   A   B
0  C1  D1  A1  B1
1  C2  D2  A2  B2
2  C3  D3  A3  B3
3  C4  D4  A4  B4

In [10]:
#combine the rows
pd.concat([one,two],axis=0)

     A    B    C    D
0   A1   B1  NaN  NaN
1   A2   B2  NaN  NaN
2   A3   B3  NaN  NaN
3   A4   B4  NaN  NaN
0  NaN  NaN   C1   D1
1  NaN  NaN   C2   D2
2  NaN  NaN   C3   D3
3  NaN  NaN   C4   D4

In [11]:
# Rename the coulmns
two.columns=one.columns

In [12]:
two

    A   B
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

In [13]:
# Combine these dataframes now than we will see the following change
mydf=pd.concat([one,two],axis=0)

In [14]:
mydf

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

# Combine diffrent type of dataframes
 1.) If the dataframes are not in same format then we can not simply concatenate them together.
 2.) In this case we need to merge the DataFrames
 3.) This is analogous to a join command on SqL

The merge() method takes in a key argument labeled how. There are three main ways to mergeing the tables together using the how parameter.

1.) Inner 2.) outer 3.) right or left

The main idea behind the argument is to decide how to deal with the information only persent in one of the joined tables.

In [15]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [16]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [17]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

# Inner merge

In [18]:
# inner merge
# merge the above dataframes using inner on the bases of name
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

# left and right merge

Note: The order of dataframes is metter in these two operations

In [19]:
pd.merge(left=registrations,right=logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [20]:
pd.merge(left=registrations,right=logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

# Outer merge

In [21]:
pd.merge(logins,registrations,how='outer',on='name')

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     Bobo     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

In [22]:
registrations=registrations.set_index('name')

In [23]:
pd.merge(registrations,logins, left_index=True, right_on='name',how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [24]:
registrations=registrations.reset_index()

In [25]:
registrations.columns=['reg_name','reg_id']

In [26]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [31]:
results=pd.merge(registrations, logins,how='inner',left_on='reg_name', right_on='name')

In [32]:
results

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [33]:
results.drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [34]:
registrations.columns=['name','id']

In [35]:
logins.columns=['id','name']

In [36]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [37]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [38]:
# Merge Columns with same name
pd.merge(registrations, logins, how='inner', on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [40]:
# Give the Specific name to the Column
pd.merge(registrations, logins, how='inner', on='name', suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4